[
  {
    "title": "AstroTerra",
    "description": "AstroTerra is designed to detect and map lunar craters using deep learning and computer vision techniques. By analyzing high-resolution OHRC images from ISRO's Chandrayaan-2, the project enables precise crater localization. It integrates AI-driven path planning with the A* algorithm to optimize autonomous lunar rover navigation, ensuring the shortest and most efficient obstacle-free route. The project efficiently manages data using advanced data structures.",
    "imgUrl": "https://res.cloudinary.com/da0wymv5x/image/upload/v1740846553/astroterra_sibr0f.png",
    "link": "https://github.com/garvkumar68/AstroTerra"
  },  
  {
    "title": "Accident Crash Detection Emergency System ",
    "description": "The Accident Crash Detection Emergency System is a comprehensive IoT + AI-powered vehicle black box that combines sensor-based detection and computer vision. Detects other vehicles involved in the accident to enhance road safety. Upon detection, the system automatically triggers emergency alerts via SMTP email, ensuring incident reporting.",
    "imgUrl": "https://res.cloudinary.com/da0wymv5x/image/upload/v1740846553/ace_nume3m.png",
    "link": "https://github.com/garvkumar68/Accident-Crash-Detection-Emergency-System"
  },
  {
    "title": "Brain Wizard",
    "description": "Brain Wizard is an AI-powered mental health assistant designed to provide real-time support through speech and text interactions. It leverages NLP, Generative AI, and chatbot functionality to offer mental health insights.Features: 🗣 Conversational AI Chatbot 📊 AI-Powered Sentiment Analysis: Detects user emotions and mental states.🧠 Mental Disorder Detection: transformer models analyzation 🧘 Meditation & Well-being Advice 📄 PDF Report Generation",
    "imgUrl": "https://res.cloudinary.com/da0wymv5x/image/upload/v1740846553/brainwizard_bnl2sr.jpg",
    "link": "https://garvkumar68.github.io/BrainWizard-website/"
  },
  {
    "title": "Smart Cleaning Robot for High-Rise Buildings",
    "description": "A lightweight, wire-powered smart cleaning robot designed for high-rise buildings to ensure efficient and eco-friendly window and surface cleaning. Designed using Autodesk Fusion 360, the robot features an aerodynamic aluminum exterior for stability and efficiency. It operates on an integrated wire system instead of batteries, reducing e-waste and increasing operational time while ensuring uninterrupted performance.",
    "imgUrl": "https://res.cloudinary.com/da0wymv5x/image/upload/v1740846553/highriser_lsrapk.png",
    "link": "https://github.com/garvkumar68/HIGH-RISER-ROBOT-3D-DESIGN"
  },  
  {
    "title": "The Murphy System",
    "description": "Multi-disease medical diagnosis platform that leverages machine learning and deep learning for accurate and automated disease detection. Combined multiple ML model Random Forest, CNN, DNN, NLP, GenAi. Features: Brain Wizard AI-powered mental health assistant 🤖 Brain Tumor Detection 🧠 Breast Cancer Classification 🎗 Symptom-Based Disease Prediction 🤒Automated Report Generation 📄",
    "imgUrl": "https://res.cloudinary.com/da0wymv5x/image/upload/v1740846553/murphy_ewp45s.png",
    "link": "https://garvkumar68.github.io/Murphy-System/"
  }
]
